/****************************************************************************/
/*                      配列を渡す関数（練習3） タブ4                    	*/
/*																			*/
/*	□3週目練習3のプログラム(ex2-3.c)の1次変換を計算する部分を関数に纏める  */
/*  □引数のポインタ表現　　　　　　　　　　　　　　　　　　　　　　　　　　*/
/*																			*/
/****************************************************************************/
#include <stdio.h>
#define N 2

//関数のプロトタイプ宣言
void linear_transf(double a[][N], double *x, double *y);
/****************************************************************************/
/*								main関数									*/
/****************************************************************************/
int main( void )
{
  	double 	a[2][2]={{0.5, -0.866},{0.866, 0.5}},	//行列A
  			x[2]={3.3, 5.8},						//ベクトルx
			y[2]={0};								//ベクトルy

	linear_transf(a, x, y); /* 関数の呼び出し．引数に配列a,x,yの先頭アドレス
							   を渡す．*/
  	return 0;
}
/* -------------------------------------------------------------------------*/
/*			関数名: linear_transf											*/
/*			仮引数：double a[][N], double *x, double *y						*/
/*			戻り値：void(なし)												*/
/*			機　能：ベクトルxの行列Aによる1次変換を計算した結果yを画面に    */
/*      　　　　　　出力する. Nは次元数．                                   */
/*--------------------------------------------------------------------------*/
void linear_transf(double a[][N], double *x, double *y)
{
	int i,j; /* 関数の中で使用する変数の宣言 */
	
	//1次変換の計算
	for(i=0;i<N;i++){
    	y[i] = 0.0;
    	for(j=0;j<N;j++){
			y[i]+=a[i][j]*x[j];	//配列yの第i成分の計算
		}
    	printf("y[%d] = %f\n", i, y[i]);
  	}
}
