/*------------------------------------------------------------------*/
/*      		 			<ex8-3.c>			  	    			*/
/*　        2次元配列の要素が1次元配列であることを確認する　  　　  */
/*　　　　  2次元配列の部分配列の要素を参照する　        　　　　　 */
/*------- ----------------------------------------------------------*/
#include <stdio.h>

int main(void)
{
	char 	a[3][7]={"red", "blue", "yellow"}; 	//２次元配列の宣言と初期化
	int 	i,j;
	
	for(i=0;i<3;i++) printf("a[%d]=%p\n", i, a[i]);//a[i]の指すアドレスの表示
	for(i=0;i<3;i++) printf("a[%d]=%s\n", i, a[i]);//a[i]の指す文字列の表示

	for(i=0;i<3;i++) printf("a+%d=%p\n", i, a+i);	 //a+iの指すアドレスの表示
	for(i=0;i<3;i++) printf("a+%d=%s\n", i, a+i);	 //a+iの指す文字列の表示
	printf("-----------------------------\n");

	for(i=0;i<3;i++){	//a[i][j]の表示
		j=0;
		while(a[i][j]!='\0'){
			printf("a[%d][%d]=%c\n",i,j,a[i][j]);
			j++;
		}
	}
	printf("-----------------------------\n");

	for(i=0;i<3;i++){	//*(a[i]+j)の表示
		j=0;
		while(*(a[i]+j)!='\0'){
			printf("*(a[%d]+%d)=%c\n",i,j,*(a[i]+j));
			j++;
		}
	}

	return 0;
}
